; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared3 - mode
	infrared2 - mode
	image1 - mode
	image0 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation2 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 176)
	(= (data Star5 infrared3) 59)
	(= (data Phenomenon6 infrared3) 62)
	(= (data Planet7 infrared3) 36)
	(= (data Planet8 infrared3) 250)
	(= (data Phenomenon9 infrared3) 90)
	(= (data Planet10 infrared3) 25)
	(= (data Phenomenon11 infrared3) 262)
	(= (data Star5 infrared2) 32)
	(= (data Phenomenon6 infrared2) 127)
	(= (data Planet7 infrared2) 276)
	(= (data Planet8 infrared2) 129)
	(= (data Phenomenon9 infrared2) 67)
	(= (data Planet10 infrared2) 36)
	(= (data Phenomenon11 infrared2) 207)
	(= (data Star5 image1) 172)
	(= (data Phenomenon6 image1) 109)
	(= (data Planet7 image1) 12)
	(= (data Planet8 image1) 135)
	(= (data Phenomenon9 image1) 219)
	(= (data Planet10 image1) 298)
	(= (data Phenomenon11 image1) 20)
	(= (data Star5 image0) 152)
	(= (data Phenomenon6 image0) 240)
	(= (data Planet7 image0) 108)
	(= (data Planet8 image0) 296)
	(= (data Phenomenon9 image0) 289)
	(= (data Planet10 image0) 37)
	(= (data Phenomenon11 image0) 226)
	(= (slew_time GroundStation1 Star0) 33.73)
	(= (slew_time Star0 GroundStation1) 33.73)
	(= (slew_time GroundStation3 Star0) 14.58)
	(= (slew_time Star0 GroundStation3) 14.58)
	(= (slew_time GroundStation3 GroundStation1) 21.41)
	(= (slew_time GroundStation1 GroundStation3) 21.41)
	(= (slew_time GroundStation3 GroundStation2) 35.11)
	(= (slew_time GroundStation2 GroundStation3) 35.11)
	(= (slew_time Star4 Star0) 9.532)
	(= (slew_time Star0 Star4) 9.532)
	(= (slew_time Star4 GroundStation1) 30.81)
	(= (slew_time GroundStation1 Star4) 30.81)
	(= (slew_time Star4 GroundStation2) 23.82)
	(= (slew_time GroundStation2 Star4) 23.82)
	(= (slew_time Star4 GroundStation3) 27.18)
	(= (slew_time GroundStation3 Star4) 27.18)
	(= (slew_time GroundStation2 Star0) 19.68)
	(= (slew_time Star0 GroundStation2) 19.68)
	(= (slew_time GroundStation2 GroundStation1) 60.59)
	(= (slew_time GroundStation1 GroundStation2) 60.59)
	(= (slew_time Star5 Star0) 75.96)
	(= (slew_time Star0 Star5) 75.96)
	(= (slew_time Star5 GroundStation1) 26.68)
	(= (slew_time GroundStation1 Star5) 26.68)
	(= (slew_time Star5 GroundStation2) 18.51)
	(= (slew_time GroundStation2 Star5) 18.51)
	(= (slew_time Star5 GroundStation3) 58.89)
	(= (slew_time GroundStation3 Star5) 58.89)
	(= (slew_time Star5 Star4) 13.95)
	(= (slew_time Star4 Star5) 13.95)
	(= (slew_time Phenomenon6 Star0) 39.86)
	(= (slew_time Star0 Phenomenon6) 39.86)
	(= (slew_time Phenomenon6 GroundStation1) 17.73)
	(= (slew_time GroundStation1 Phenomenon6) 17.73)
	(= (slew_time Phenomenon6 GroundStation2) 35.7)
	(= (slew_time GroundStation2 Phenomenon6) 35.7)
	(= (slew_time Phenomenon6 GroundStation3) 8.871)
	(= (slew_time GroundStation3 Phenomenon6) 8.871)
	(= (slew_time Phenomenon6 Star4) 1.681)
	(= (slew_time Star4 Phenomenon6) 1.681)
	(= (slew_time Phenomenon6 Star5) 18.16)
	(= (slew_time Star5 Phenomenon6) 18.16)
	(= (slew_time Planet7 Star0) 9.335)
	(= (slew_time Star0 Planet7) 9.335)
	(= (slew_time Planet7 GroundStation1) 43.8)
	(= (slew_time GroundStation1 Planet7) 43.8)
	(= (slew_time Planet7 GroundStation2) 63.19)
	(= (slew_time GroundStation2 Planet7) 63.19)
	(= (slew_time Planet7 GroundStation3) 24.39)
	(= (slew_time GroundStation3 Planet7) 24.39)
	(= (slew_time Planet7 Star4) 34.75)
	(= (slew_time Star4 Planet7) 34.75)
	(= (slew_time Planet7 Star5) 2.643)
	(= (slew_time Star5 Planet7) 2.643)
	(= (slew_time Planet7 Phenomenon6) 58.38)
	(= (slew_time Phenomenon6 Planet7) 58.38)
	(= (slew_time Planet8 Star0) 60.15)
	(= (slew_time Star0 Planet8) 60.15)
	(= (slew_time Planet8 GroundStation1) 71.64)
	(= (slew_time GroundStation1 Planet8) 71.64)
	(= (slew_time Planet8 GroundStation2) 24.37)
	(= (slew_time GroundStation2 Planet8) 24.37)
	(= (slew_time Planet8 GroundStation3) 33.11)
	(= (slew_time GroundStation3 Planet8) 33.11)
	(= (slew_time Planet8 Star4) 0.1275)
	(= (slew_time Star4 Planet8) 0.1275)
	(= (slew_time Planet8 Star5) 4.796)
	(= (slew_time Star5 Planet8) 4.796)
	(= (slew_time Planet8 Phenomenon6) 20.46)
	(= (slew_time Phenomenon6 Planet8) 20.46)
	(= (slew_time Planet8 Planet7) 44.51)
	(= (slew_time Planet7 Planet8) 44.51)
	(= (slew_time Phenomenon9 Star0) 79.25)
	(= (slew_time Star0 Phenomenon9) 79.25)
	(= (slew_time Phenomenon9 GroundStation1) 14.86)
	(= (slew_time GroundStation1 Phenomenon9) 14.86)
	(= (slew_time Phenomenon9 GroundStation2) 17.89)
	(= (slew_time GroundStation2 Phenomenon9) 17.89)
	(= (slew_time Phenomenon9 GroundStation3) 25.07)
	(= (slew_time GroundStation3 Phenomenon9) 25.07)
	(= (slew_time Phenomenon9 Star4) 59.43)
	(= (slew_time Star4 Phenomenon9) 59.43)
	(= (slew_time Phenomenon9 Star5) 15.03)
	(= (slew_time Star5 Phenomenon9) 15.03)
	(= (slew_time Phenomenon9 Phenomenon6) 12.03)
	(= (slew_time Phenomenon6 Phenomenon9) 12.03)
	(= (slew_time Phenomenon9 Planet7) 32.25)
	(= (slew_time Planet7 Phenomenon9) 32.25)
	(= (slew_time Phenomenon9 Planet8) 41.85)
	(= (slew_time Planet8 Phenomenon9) 41.85)
	(= (slew_time Planet10 Star0) 25.36)
	(= (slew_time Star0 Planet10) 25.36)
	(= (slew_time Planet10 GroundStation1) 14.32)
	(= (slew_time GroundStation1 Planet10) 14.32)
	(= (slew_time Planet10 GroundStation2) 65.09)
	(= (slew_time GroundStation2 Planet10) 65.09)
	(= (slew_time Planet10 GroundStation3) 45.04)
	(= (slew_time GroundStation3 Planet10) 45.04)
	(= (slew_time Planet10 Star4) 76.16)
	(= (slew_time Star4 Planet10) 76.16)
	(= (slew_time Planet10 Star5) 44.69)
	(= (slew_time Star5 Planet10) 44.69)
	(= (slew_time Planet10 Phenomenon6) 20.67)
	(= (slew_time Phenomenon6 Planet10) 20.67)
	(= (slew_time Planet10 Planet7) 2.067)
	(= (slew_time Planet7 Planet10) 2.067)
	(= (slew_time Planet10 Planet8) 39.18)
	(= (slew_time Planet8 Planet10) 39.18)
	(= (slew_time Planet10 Phenomenon9) 23.72)
	(= (slew_time Phenomenon9 Planet10) 23.72)
	(= (slew_time Phenomenon11 Star0) 37.82)
	(= (slew_time Star0 Phenomenon11) 37.82)
	(= (slew_time Phenomenon11 GroundStation1) 20.26)
	(= (slew_time GroundStation1 Phenomenon11) 20.26)
	(= (slew_time Phenomenon11 GroundStation2) 41.94)
	(= (slew_time GroundStation2 Phenomenon11) 41.94)
	(= (slew_time Phenomenon11 GroundStation3) 51.87)
	(= (slew_time GroundStation3 Phenomenon11) 51.87)
	(= (slew_time Phenomenon11 Star4) 70.87)
	(= (slew_time Star4 Phenomenon11) 70.87)
	(= (slew_time Phenomenon11 Star5) 73.39)
	(= (slew_time Star5 Phenomenon11) 73.39)
	(= (slew_time Phenomenon11 Phenomenon6) 59.84)
	(= (slew_time Phenomenon6 Phenomenon11) 59.84)
	(= (slew_time Phenomenon11 Planet7) 51.74)
	(= (slew_time Planet7 Phenomenon11) 51.74)
	(= (slew_time Phenomenon11 Planet8) 24.59)
	(= (slew_time Planet8 Phenomenon11) 24.59)
	(= (slew_time Phenomenon11 Phenomenon9) 13.85)
	(= (slew_time Phenomenon9 Phenomenon11) 13.85)
	(= (slew_time Phenomenon11 Planet10) 43.85)
	(= (slew_time Planet10 Phenomenon11) 43.85)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Phenomenon6 image1)
	(have_image Planet8 image1)
	(have_image Phenomenon9 image0)
	(have_image Planet10 infrared2)
	(have_image Phenomenon11 image0)
))
(:metric minimize (fuel-used))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 5
3. (turn_to satellite0 phenomenon6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 176 to 140.3, (fuel-used) from 0 to 35.7
   goals met: 0 of 5
4. (take_image satellite0 phenomenon6 instrument0 image1)
   added: (have_image phenomenon6 image1)
   changed: (data_capacity satellite0) from 1000 to 891, (data-stored) from 0 to 109
   goals met: 1 of 5
5. (turn_to satellite0 star5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 140.3 to 122.14, (fuel-used) from 35.7 to 53.86
   goals met: 1 of 5
6. (turn_to satellite0 planet7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 122.14 to 119.497, (fuel-used) from 53.86 to 56.503
   goals met: 1 of 5
7. (turn_to satellite0 planet10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 119.497 to 117.43, (fuel-used) from 56.503 to 58.57
   goals met: 1 of 5
8. (take_image satellite0 planet10 instrument0 infrared2)
   added: (have_image planet10 infrared2)
   changed: (data_capacity satellite0) from 891 to 855, (data-stored) from 109 to 145
   goals met: 2 of 5
9. (turn_to satellite0 planet7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 117.43 to 115.363, (fuel-used) from 58.57 to 60.637
   goals met: 2 of 5
10. (turn_to satellite0 star5 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 115.363 to 112.72, (fuel-used) from 60.637 to 63.28
   goals met: 2 of 5
11. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 2 of 5
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 5
13. (turn_to satellite0 groundstation2 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 112.72 to 94.21, (fuel-used) from 63.28 to 81.79
   goals met: 2 of 5
14. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 2 of 5
15. (turn_to satellite0 phenomenon9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon9)
   changed: (fuel satellite0) from 94.21 to 76.32, (fuel-used) from 81.79 to 99.68
   goals met: 2 of 5
16. (turn_to satellite0 phenomenon11 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon11)
   changed: (fuel satellite0) from 76.32 to 62.47, (fuel-used) from 99.68 to 113.53
   goals met: 2 of 5
17. (take_image satellite0 phenomenon11 instrument1 image0)
   added: (have_image phenomenon11 image0)
   changed: (data_capacity satellite0) from 855 to 629, (data-stored) from 145 to 371
   goals met: 3 of 5
18. (turn_to satellite0 phenomenon9 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon9)
   changed: (fuel satellite0) from 62.47 to 48.62, (fuel-used) from 113.53 to 127.38
   goals met: 3 of 5
19. (take_image satellite0 phenomenon9 instrument1 image0)
   added: (have_image phenomenon9 image0)
   changed: (data_capacity satellite0) from 629 to 340, (data-stored) from 371 to 660
   goals met: 4 of 5
20. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 5
21. (switch_on instrument0 satellite0)
   deleted: (calibrated instrument0) (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 5
22. (turn_to satellite0 groundstation2 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 48.62 to 30.73, (fuel-used) from 127.38 to 145.27
   goals met: 4 of 5
23. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 4 of 5
24. (turn_to satellite0 planet8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet8)
   changed: (fuel satellite0) from 30.73 to 6.36, (fuel-used) from 145.27 to 169.64
   goals met: 4 of 5
25. (take_image satellite0 planet8 instrument0 image1)
   added: (have_image planet8 image1)
   changed: (data_capacity satellite0) from 340 to 205, (data-stored) from 660 to 795
   goals met: 5 of 5
